{
  "Welcome!": "Welcome!",
  "Сontent management system (CMS)": "Сontent management system (CMS)",
  "We build an Innovative Content Management System based on Yii2 framework. It's Free and Open Source.": "We build an Innovative Content Management System based on Yii2 framework. It's Free and Open Source.",
  "Download": "Download",
  "Join to Us": "Join to Us",
  "Thank you for supporting us!": "Thank you for supporting us!",
  "Let's get in touch on any of these platforms.": "Let's get in touch on any of these platforms.",
  "Powered by": "Powered by",
  "Coded by": "Coded by",
  "Modules": "Modules",
  "Documentation": "Documentation",
  "Contacts": "Contacts",
  "ID": "ID",
  "Repository": "Repository",
  "Version": "Version",
  "Ready": "Ready",
  "home.about-section": "<p>We are working on creating a truly unique platform in terms of functionality, on the basis of which it is possible to implement any project of any complexity, from a business card site, to a service or a social network. Yes, it sounds fantastic;) But, first things first...</p>\n<p>As the basis of a content management system (CMS), we opted for the <a href=\"https://www.yiiframework.com\" target=\"_blank\">Yii framework</a>. This is a dynamically developing product that combines a very flexible, understandable and functional MVC architecture and support for PHP 7.</p>\n                    <p>A huge international community of developers, thousands of lines of perfect documented code, responsive support and hundreds of extensions on GitHub for any occasion, will not leave the programmer indifferent even with the most refined taste.</p>\n<p>Among the planned functionality of <b>Butterfly.CMS</b> content management system are more than 50 functional modules, some of which have already been implemented. See the <a href=\"https://docs.google.com/spreadsheets/d/126czPo75-lbA7ySUt03l3jLV0BG_tu-cFMXaa30rh10/edit?usp=sharing\" target=\"_blank\">table for details</a>.</p>\n<p><b>Butterfly.CMS</b> will of course be distributed under a free license (MIT) and open source.</p>\n<p>A feature of the system will be socialization and internationalization out of the box. This means that you no longer need to look for solutions that can simultaneously provide a multilingual website, the social activity of its users, separation of roles, etc.</p>\n<p>In addition to the classic functionality of the content management system (unlimited page structure, publication of news, photo galleries, feedback forms, etc.), we have planned feeds, profiles, friend lists, likes and reposts. And all this will already be laid down in the functionality of the system modules, you only, as a developer, will only have to connect the corresponding models, configure the controllers and integrate the layout into the frontend.</p>\n<p><b>Butterfly.CMS</b> is planned as not the usual system that you are probably used to seeing. We do not provide for the implementation of an internal template engine and a system of html templates, which other systems have in excess of. The potential of the system is aimed at developing in the corporate segment, where the creation of the design of the future site is very important, a painstaking process that does not suffer restrictions from the system.</p>\n<p>In addition, we plan the end-to-end integration of SEO tools in all modules. This will mean that you no longer need to look for separate extensions for fine-tuning meta tags and other things separately for the gallery, product catalog, news blog, and more. Together with SEO-friendly URLs with unlimited nesting, controlled redirects, out-of-the-box turbo pages and end-to-end OpenGraph integration - you will avoid duplicate pages in the future and good mood of search engines;)</p>\n<p><b>Butterfly.CMS</b> is designed for advanced developers who can lay out the future. For sites that will grow, this will simply be an irreplaceable solution. After all, if you begin to miss the basic functionality, you can always scale by connecting your own or third-party extensions through Composer, and use them later in your project.</p>\n<p><b>Butterfly.CMS</b> internal modular architecture allows you to develop your own tools for managing the site, fine-tune its operation, create dynamic content, design and use databases, analyze statistical information, activity data received from the user, and even integrate third-party APIs with the base API of the system modules.</p>\n<p>An end-to-end API for all modules is also provided. So you can easily build single-page applications on Angular, Vue.js, etc.</p>\n<p>And finally, we would like to contact the developer community. Everyone who is interested in the idea and who feel the need to develop the project, we ask you -</p>",
  "Screenshots of the Butterfly.CMS admin panel": "Screenshots of the Butterfly.CMS admin panel",
  "modules.intro": "In this table, we display the current development progress of modules and components. Many of the modules are not displayed here, in particular those that do not have a repository or have not been registered as a package for <a href=\"https://packagist.org/users/alex-wdmg/packages/\">packagist.org</a>."
}
