{
  "Welcome!": "Приветствуем!",
  "Сontent management system (CMS)": "Cистема управления контентом (CMS)",
  "We build an Innovative Content Management System based on Yii2 framework. It's Free and Open Source.": "Мы создаем инновационную систему управления контентом на основе фреймворка Yii2. Она бесплатная и с открытым исходным кодом.",
  "Download": "Скачать",
  "Join to Us": "Присоединяйтесь",
  "Thank you for supporting us!": "Спасибо Вам за поддержку!",
  "Let's get in touch on any of these platforms.": "Оставайтесь с нами на связи с любой из этих платформ.",
  "Powered by": "Работает на",
  "Coded by": "Разработано",
  "home.about-section": "<p>Мы работаем над созданием по-настоящему уникальной в плане функциональности платформы, на основе которой можно реализовать  проект любой сложности, от сайта-визитки и до социальной сети. Да, это звучит фантастически;) Но обо всем по порядку...</p>\n<p>В качестве основы системы управления контентом (CMS) мы выбрали <a href=\"https://www.yiiframework.com\" target=\"_blank\"> инфраструктуру Yii</a>. Это динамично развивающийся продукт, который сочетает в себе очень гибкую, понятную и функциональную архитектуру MVC и поддержку PHP 7.</p>\n<p>Огромное международное сообщество разработчиков, тысячи строк идеального документированного кода, отзывчивая поддержка и сотни расширений на GitHub под любую задачу не оставят программиста даже с самым изысканным вкусом равнодушным.</p>\n<p>Среди запланированных функций системы управления контентом <b>Butterfly.CMS</b> более 50 функциональных модулей, многие из которых уже реализованы. Подробности см. в <a href=\"https://docs.google.com/spreadsheets/d/126czPo75-lbA7ySUt03l3jLV0BG_tu-cFMXaa30rh10/edit?usp=sharing\" target=\"_blank\"> таблице</a>.</p>\n<p><b>Butterfly.CMS</b>, конечно же, будет распространяться под свободной лицензией (MIT) и с открытым исходным кодом.</p>\n<p>Особенностью системы будет социализация и интернационализация \"из коробки\". Это означает, что вам больше не нужно искать решения, которые могут одновременно обеспечить многоязычность вашего приложения, социальную активность его пользователей, разделение ролей и т.д.</p>\n<p>В дополнение к классической функциональности системы управления контентом (неограниченная структура страниц, публикация новостей, фотогалереи, формы обратной связи и т.д.), а также запланированна разработка модулей: профили пользователей, списки друзей, лайки и репосты. И все это уже будет заложено в функциональность системных модулей, вам как раразботчику достаточно будет подключить соответствующие модели данных, настроить контроллеры и интегрировать вёрстку в интерфейс.</p>\n<p><b>Butterfly.CMS</b> планируется как не обычная система, которую вы вероятно привыкли видеть. Мы не предусматриваем реализацию внутреннего шаблонизатора и систему шаблонов HTML, которые имеют другие системы. Потенциал системы направлен на развитие в корпоративном сегменте, где создание дизайна будущего сайта очень важный и кропотливый процесс, который не должен быть ограничен системой.</p>\n<p>Кроме того, мы планируем комплексную интеграцию инструментов SEO во все модули. Это будет означать, что вам больше не нужно искать отдельные расширения для тонкой настройки метатегов и другие параметров оптимизации для галереи, каталога товаров, новостного блога и многого другого. Вместе с SEO-дружественными URL-адресами с неограниченной иерархией, контролируемыми перенаправлениями, готовыми турбо-страницами и сквозной интеграцией OpenGraph - вы избежите дублирования страниц в будущем и хорошего настроения поисковых систем;)</p>\n<p><b>Butterfly.CMS</b> предназначена для продвинутых разработчиков, которые могут планировать будущее. Для сайтов, которые будут расти, это будет просто необходимым решением. В конце концов, если у вас возникнет необходимость в дополнительном функционале, вы всегда можете масштабировать проект, подключая свои собственные или сторонние расширения через Composer.</p>\n<p>Внутренняя модульная архитектура <b>Butterfly.CMS</b> позволяет разрабатывать собственные инструменты для управления сайтом, тонко настраивать его работу, создавать динамический контент, проектировать и использовать базы данных, анализировать статистическую информацию, полученные данные об активности. от пользователя, и даже интегрировать сторонние API с базовым API системных модулей.</p>\n<p>Также предоставляется сквозной API для всех модулей. Таким образом, вы можете легко создавать одностраничные приложения (SPA) на Angular, Vue.js и т.д.</p>\n<p>И, наконец, мы хотели бы связаться с сообществом разработчиков. Всех, кому интересна идея и кто чувствует необходимость развивать проект, мы просим вас -</p>",
  "Screenshots of the Butterfly.CMS admin panel": "Скриншоты административного интерфейса Butterfly.CMS"
}
