{
  "Welcome!": "Вітаємо!",
  "Сontent management system (CMS)": "Cистема управління контентом (CMS)",
  "We build an Innovative Content Management System based on Yii2 framework. It's Free and Open Source.": "Ми створюємо інноваційну систему управління контентом на основі фреймворку Yii2. Вона безкоштовна і з відкритим вихідним кодом.",
  "Download": "Завантажити",
  "Join to Us": "Приєднуйтесь",
  "Thank you for supporting us!": "Дякуємо вам за підтримку!",
  "Let's get in touch on any of these platforms.": "Залишайтеся з нами на зв'язку з будь-якою з цих платформ.",
  "Powered by": "Працює на",
  "Coded by": "Розроблено у",
  "About": "Про проект",
  "Modules": "Модулі",
  "Documentation": "Документація",
  "Contacts": "Контакти",
  "ID": "ID",
  "Repository": "Репозиторій",
  "Version": "Версія",
  "Ready": "Готовність",
  "home.about-section": "<p>Ми працюємо над створенням справді унікальної платформи з точки зору функціональності, на основі якої можна реалізувати будь-який проект будь-якої складності - від сайту візитної картки, до сайту послуг чи соціальної мережі. Так, це звучить фантастично;) Але про все по порядку...</p>\n<p>В якості основи системи управління контентом (CMS) ми обрали <a href=\"https://www.yiiframework.com\" target=\"_blank\"> Yii фреймворк</a>. Це продукт, що динамічно розвивається та який поєднує в собі дуже гнучку, зрозумілу та функціональну архітектуру MVC та підтримку PHP 7.</p>\n<p>Величезна міжнародна спільнота розробників, тисячі рядків ідеального документованого коду, чуйна підтримка та сотні розширень на GitHub під будь-яке завдання не залишать програміста байдужим навіть із самим вишуканим смаком.</p>\n<p>Серед запланованих функціональних можливостей системи управління контентом <b>Butterfly.CMS</b> є понад 50 функціональних модулів, частина з яких вже реалізована. Детальну інформацію див. <a href=\"https://docs.google.com/spreadsheets/d/126czPo75-lbA7ySUt03l3jLV0BG_tu-cFMXaa30rh10/edit?usp=sharing\" target=\"_blank\">у таблиці</a>.</p>\n<p><b>Butterfly.CMS</b>, звичайно буде розповсюджуватися за безкоштовною ліцензією (MIT) та відкритим кодом.</p>\n<p>Особливістю системи буде соціалізація та інтернаціоналізація за замовчуванням. Це означає, що вам більше не потрібно шукати рішення, які можуть одночасно забезпечити веб-сайт багатомовністю, чи підтримку соціальної активності його користувачів, розділення ролей тощо.</p>\n<p>Окрім класичної функціональності системи управління контентом (необмежена структура сторінок, публікація новин, фотогалереї, форми зворотного зв’язку тощо), ми запланували канали, профілі, списки друзів, лайки та репост. І все це вже буде закладено у функціональності системних модулів, вам як розробнику, потрібно буде лише підключити відповідні моделі даних, налаштувати контролери та інтегрувати макет у фронтенд.</p>\n<p><b>Butterfly.CMS</b> планується як не звичайна система, яку ви мабуть звикли бачити. Ми не передбачаємо реалізацію внутрішнього двигуна шаблонів та системи шаблонів html, які мають інші системи. Потенціал системи спрямований на розвиток у корпоративному сегменті, де створення дизайну майбутнього сайту є дуже важливим та кропітким процесом, який не повинен бути обмежений системою.</p>\n<p>Крім того, ми плануємо комплексну інтеграцію інструментів SEO у всіх модулях. Це означає, що вам більше не потрібно шукати окремих розширень для тонкої настройки метатегів та інших речей окремо для галереї, каталогу продуктів, блогу новин тощо. Разом із SEO-дружніми URL-адресами з необмеженою ієрархією, контрольованими переадресаціями, нестандартними турбо-сторінками та інтегрованою інтеграцією OpenGraph - ви уникнете повторюваних сторінок у майбутньому та гарного настрою пошукових систем;)</p>\n<p><b>Butterfly.CMS</b> призначений для просунутих розробників, які можуть планувати майбутнє. Для сайтів, які будуть рости, це буде просто незамінним рішенням. Зрештою, якщо у вас виникне необхідність, ви завжди можете масштабувати проект, підключаючи власні або сторонні розширення через Composer.</p>\n<p>Внутрішня модульна архітектура <b>Butterfly.CMS</b> дозволяє розробити власні інструменти для управління сайтом, налагодити його роботу, створити динамічний контент, проектувати та використовувати бази даних, аналізувати статистичну інформацію, отримані дані про діяльність від користувача і навіть інтегрувати сторонні API-інтерфейси з базовим API системних модулів.</p>\n<p>Також надається кінцевий API для всіх модулів. Таким чином, ви можете легко створювати односторінкові програми на Angular, Vue.js тощо.</p>\n<p>І нарешті, ми хотіли б зв’язатися із спільнотою розробників. Всіх, хто зацікавився ідеєю та відчуває потребу в розробці проекту, ми просимо вас -</p>",
  "Screenshots of the Butterfly.CMS": "Скриншоти інтерфейсу Butterfly.CMS",
  "modules.intro": "У цій таблиці ми відображаємо поточний хід розробки модулів та компонентів. Багато модулів тут не відображаються, зокрема такі, які ще не мають сховища або не були зареєстровані як пакет для <a href=\"https://packagist.org/users/alex-wdmg/packages/\">packagist.org</a>."
}
